# Programm-by-Excel
план_продаж_кислорода_в_тоннах_в_месяц=int(input())
план_продаж_азот_в_тоннах_в_месяц=int(input())
всего_продукта_для_продажи_в_тоннах=int(input())
затраты_энергии_в_МВатт_в_час_для_режима_MAXLOX=int(input())
затраты_энергии_в_МВатт_в_час_для_режима_MAXLIN=int(input())
затраты_энергии_в_МВатт_в_час_для_режима_MIXED=int(input())
план_продаж_кислорода_в_тоннах_за_день=float(input())
план_продаж_азота_в_тоннах_за_день=float(input())
режим=str(input())
if режим=="MAXLOX":
    print(план_продаж_кислорода_в_тоннах_за_день, "35", "0", (35+0), ((100-план_продаж_кислорода_в_тоннах_за_день+35)-план_продаж_кислорода_в_тоннах_за_день*0.057), ((50-план_продаж_азота_в_тоннах_за_день+0)-план_продаж_азота_в_тоннах_за_день*0.057), затраты_энергии_в_МВатт_в_час_для_режима_MAXLOX)
if режим=="MAXLIN":
    print(план_продаж_кислорода_в_тоннах_за_день, "5", "20", (5+20), ((100-план_продаж_кислорода_в_тоннах_за_день+5)-план_продаж_кислорода_в_тоннах_за_день*0.057), ((50-план_продаж_азота_в_тоннах_за_день+20)-план_продаж_азота_в_тоннах_за_день*0.057), затраты_энергии_в_МВатт_в_час_для_режима_MAXLIN)
if режим=="MIXED":
    print(план_продаж_кислорода_в_тоннах_за_день, "15", "15", (15+15), ((100-план_продаж_кислорода_в_тоннах_за_день+15)-план_продаж_кислорода_в_тоннах_за_день*0.057), ((50-план_продаж_азота_в_тоннах_за_день+15)-план_продаж_азота_в_тоннах_за_день*0.057), затраты_энергии_в_МВатт_в_час_для_режима_MIXED)

    
